app/Controllers/LoginController.php

    public function Auth()
{
    $UserModel = new M_User();
    $username = $this->request->getPost('username');
    $password = $this->request->getPost('password');

    $user = $UserModel->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'developer'
 LIMIT 1